function categoryChange() {
	var arr6110000 = ["가정보호", "강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구", "서울특별시", "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중랑구"];
	var arr6110000value = ["6119999", "3220000", "3240000", "3080000", "3150000","3200000","3040000","3160000","3170000","3100000","3090000","3050000","3190000","3130000","3120000","6119998","3210000","3030000","3070000","3230000","3140000","3180000","3020000","3110000","3000000", "3010000","3060000"];

	var arr6260000 = ["강서구", "금정구", "기장군", "남구", "동구", "동래구", "부산진구", "북구",  "사상구", "사하구", "서구", "수영구", "연제구", "영도구", "중구", "해운대구"];
	var arr6260000value = ["3360000", "3350000", "3400000", "3310000", "3270000", "3300000", "3290000", "3320000", "3390000", "3340000",  "3260000", "3380000",  "3370000", "3280000",  "3250000", "3330000"];

	var arr6270000 = ["남구", "달서구", "달성군", "동구", "북구", "서구", "수성구", "중구"];
	var arr6270000value = ["3440000", "3470000", "3480000", "3420000", "3450000", "3430000", "3460000", "3410000"];

	var arr6280000 = [ "강화군", "계양구", "남동구", "동구", "미추홀구", "부평구", "서구", "연수구", "옹진군","중구" ];
	var arr6280000value = ["3570000", "3550000", "3530000", "3500000", "3510500", "3540000", "3560000", "3520000", "3580000", "3490000"];

	var arr6290000 = ["광산구", "남구", "동구", "북구", "서구"];
	var arr6290000value = ["3630000", "3610000", "3590000", "3620000", "3600000"];

	var arr5690000 = [];
	var arr5690000value = [];

	var arr6300000 = ["대덕구", "동구", "서구", "유성구", "중구"];
	var arr6300000value = ["3680000", "3640000", "3660000", "3670000", "3650000"];

	var arr6310000 = ["남구", "동구", "북구", "울주군", "중구"];
	var arr6310000value = ["3700000", "3710000", "3720000", "3730000", "3690000"];

	var arr6410000 = ["가평군", "고양시", "과천시", "광명시", "광주시", "구리시", "군포시", "김포시", "남양주시", "동두천시", "부천시", "성남시", "수원시", "시흥시", "안산시", "안성시", "안양시", "양주시", "양평군", "여주시", "연천군",  "오산시", "용인시", "용인시 기흥구", "의왕시",  "의정부시", "이천시", "파주시", "평택시", "포천시", "하남시", "화성시"];
	var arr6410000value = ["4160000", "3940000", "3970000", "3900000", "5540000", "3980000", "4020000", "4090000", "3990000", "3920000", "3860000",  "3780000", "3740000", "4010000", "3930000", "4080000", "3830000", "5590000", "4170000", "5700000", "4140000", "4000000",  "4050000", "5630000", "4030000", "3820000", "4070000", "4060000", "3910000", "5600000", "4040000", "5530000"];

	var arr6420000 = ["강릉시", "고성군", "동해시", "삼척시", "속초시", "양구군", "양양군", "영월군", "원주시", "인제군", "정선군", "철원군", "춘천시", "태백시", "평창군", "홍천군", "화천군", "횡성군"];
	var arr6420000value = ["4200000", "4340000", "4210000", "4240000", "4230000", "4320000", "4350000", "4270000", "4190000", "4330000", "4290000", "4300000",  "4180000", "4220000", "4280000", "4250000", "4310000", "4260000"];

	var arr6430000 = ["괴산군", "단양군", "보은군", "영동군", "옥천군", "음성군", "제천시", "증평군", "진천군", "청주시", "충주시"];
	var arr6430000value = ["4460000", "4480000", "4420000", "4440000", "4430000", "4470000", "4400000", "5570000", "4450000", "5710000", "4390000"];

	var arr6440000 = ["계룡시", "공주시", "금산군", "논산시", "당진시", "보령시", "부여군", "서산시", "서천군", "아산시", "연기군", "예산군", "천안시", "청양군", "태안군",  "홍성군"];
	var arr6440000value = ["5580000", "4500000", "4550000", "4540000", "5680000", "4510000", "4570000", "4530000",  "4580000", "4520000",  "4560000", "4610000", "4490000", "4590000",  "4620000", "4600000"];

	var arr6450000 = ["고창군", "군산시", "김제시", "남원시", "무주군", "부안군", "순창군", "완주군", "익산시", "임실군", "장수군", "전주시", "정읍시", "진안군"];
	var arr6450000value = ["4780000", "4670000", "4710000", "4700000", "4740000", "4790000", "4770000", "4720000", "4680000", "4760000",  "4750000", "4640000", "4690000",  "4730000"];

	var arr6460000 = ["강진군", "고흥군", "곡성군", "광양시", "구례군", "나주시", "담양군", "목포시", "무안군", "보성군", "순천시", "신안군", "여수시", "영광군", "영암군", "완도군", "장성군", "장흥군", "진도군", "함평군", "해남군",  "화순군"];
	var arr6460000value = ["4920000", "4880000", "4860000", "4840000", "4870000", "4830000", "4850000", "4800000", "4950000", "4890000", "4820000", "5010000", "4810000", "4970000", "4940000", "4990000", "4980000", "4910000", "5000000", "4960000", "4930000", "4900000"];

	var arr6470000 = ["경산시", "경주시", "고령군", "구미시", "군위군", "김천시", "문경시", "봉화군", "상주시", "성주군", "안동시", "영덕군", "영양군", "영주시",  "영천시", "예천군", "울릉군", "울진군", "의성군", "청도군", "청송군", "칠곡군", "포항시"];
	var arr6470000value = ["5130000", "5050000", "5200000", "5080000", "5140000", "5060000", "5120000", "5240000", "5110000", "5210000", "5070000", "5180000", "5170000", "5090000", "5100000", "5230000", "5260000", "5250000", "5150000", "5190000", "5160000", "5220000", "5020000"];

	var arr6480000 = ["거제시", "거창군", "고성군", "김해시", "남해군", "밀양시", "사천시", "산청군", "양산시", "의령군", "진주시", "창녕군", "창원 마산합포회원구", "창원 의창성산구", "원 진해구", "통영시", "하동군", "함안군", "함양군", "합천군"];
	var arr6480000value = ["5370000", "5470000", "5420000", "5350000", "5430000", "5360000", "5340000", "5450000", "5380000", "5390000", "5310000", "5410000", "5280000", "5670000", "5320000", "5330000", "5440000", "5400000", "5460000", "5480000"];

	var arr6500000 = ["서귀포시", "제주시", "제주특별자치도"];
	var arr6500000value = ["6520000", "6510000", "6500000"];


	var sido = document.getElementById("sido");
	var selectedValue = sido.options[sido.selectedIndex].value;


	if (selectedValue == "6110000") {
		var d = arr6110000;
		var v = arr6110000value;
	} else if (selectedValue == "6260000") {
		var d = arr6260000;
		var v = arr6260000value;
	} else if (selectedValue == "6270000") {
		var d = arr6270000;
		var v = arr6270000value;
	} else if (selectedValue == "6280000") {
		var d = arr6280000;
		var v = arr6280000value;
	} else if (selectedValue == "6290000") {
		var d = arr6290000;
		var v = arr6290000value;
	} else if (selectedValue == "5690000") {
		var d = arr5690000;
		var v = arr5690000value;
	} else if (selectedValue == "6300000") {
		var d = arr6300000;
		var v = arr6300000value;
	} else if (selectedValue == "6310000") {
		var d = arr6310000;
		var v = arr6310000value;
	} else if (selectedValue == "6410000") {
		var d = arr6410000;
		var v = arr6410000value;
	} else if (selectedValue == "6420000") {
		var d = arr6420000;
		var v = arr6420000value;
	} else if (selectedValue == "6430000") {
		var d = arr6430000;
		var v = arr6430000value;
	} else if (selectedValue == "6440000") {
		var d = arr6440000;
		var v = arr6440000value;
	} else if (selectedValue == "6450000") {
		var d = arr6450000;
		var v = arr6450000value;
	} else if (selectedValue == "6460000") {
		var d = arr6460000;
		var v = arr6460000value;
	} else if (selectedValue == "6470000") {
		var d = arr6470000;
		var v = arr6470000value;
	} else if (selectedValue == "6480000") {
		var d = arr6480000;
		var v = arr6480000value;
	} else if (selectedValue == "6500000") {
		var d = arr6500000;
		var v = arr6500000value;
	}
	var target = document.getElementById("gu");
	target.options.length = 0;

	for (x in d) {
		var opt = document.createElement("option");
		opt.value = v[x];
		opt.innerHTML = d[x];
		target.appendChild(opt);
	}
}

function category_kind(){
	var arr417000 = ["골든 리트리버","그레이 하운드","그레이트 덴","그레이트 피레니즈","기타","꼬똥 드 뚤레아","네오폴리탄 마스티프","노르포크 테리어","노리치 테리어","뉴펀들랜드","닥스훈트","달마시안","댄디 딘몬트 테리어","도고 까니리오","도고 아르젠티노","도고 아르젠티노","도베르만","도사","동경견","라브라도 리트리버","라사 압소","라이카","래빗 닥스훈드","랫 테리어","레이크랜드 테리어","로디지안 리즈백 ","로트바일러","롯트와일러","마리노이즈","마스티프","말라뮤트","말티즈","맨체스터테리어","미니어쳐 닥스훈트","미니어쳐 불 테리어","미니어쳐 슈나우저","미니어쳐 푸들","미니어쳐 핀셔","미디엄 푸들","미텔 스피츠","믹스견","바센지","바셋 하운드","버니즈 마운틴 독","베들링턴 테리어","벨기에 그로넨달","벨기에 쉽독","벨기에 테뷰런","벨지안 셰퍼드 독","보더 콜리","보르조이","보스턴 테리어","복서","볼로네즈","부비에 데 플랑드르","불 테리어","불독","브뤼셀그리펀","브리타니 스파니엘","블랙 테리어","비글","비숑 프리제","비어디드 콜리","비즐라","빠삐용","사모예드","살루키","삽살개","샤페이","세인트 버나드","센트럴 아시안 오브차카","셔틀랜드 쉽독","셰퍼드","슈나우져","스코티쉬 테리어","스코티시 디어하운드","스탠다드 푸들","스테포드셔불테리어","스피츠","시바","시베리안 허스키","시베리안라이카","시잉프랑세즈","시츄","시코쿠","실리햄 테리어","실키테리어","아나톨리안 셰퍼드","아메리칸 불독","아메리칸 스태퍼드셔 테리어","아메리칸 아키다","아메리칸 에스키모","아메리칸 코카 스파니엘","아메리칸 핏불 테리어","아메리칸불리","아이리쉬 레드 앤 화이트 세터","아이리쉬 세터","아이리쉬 울프 하운드","아이리쉬소프트코튼휘튼테리어","아키다","아프간 하운드","알라스칸 말라뮤트","에어델 테리어","오브차카","오스트랄리안 셰퍼드 독","오스트랄리안 캐틀 독","올드 잉글리쉬 불독","올드 잉글리쉬 쉽독","와이마라너","와이어 폭스 테리어","요크셔 테리어","울프독","웨스트 시베리언 라이카","웨스트하이랜드화이트테리어","웰시 코기 카디건","웰시 코기 펨브로크","웰시 테리어","이탈리안 그레이 하운드","잉글리쉬 세터","잉글리쉬 스프링거 스파니엘","잉글리쉬 코카 스파니엘","잉글리쉬 포인터","자이언트 슈나우져","재패니즈 스피츠","잭 러셀 테리어","저먼 셰퍼드 독","저먼 와이어헤어드 포인터","저먼 포인터","제주개","제페니즈칭","진도견","차우차우","차이니즈 크레스티드 독","치와와","카레리안 베어독","카이훗","캐벌리어 킹 찰스 스파니엘","케니스펜더","케리 블루 테리어","케언 테리어","케인 코르소","코리아 트라이 하운드","코리안 마스티프","코카 스파니엘","코카 푸","코카시안오브차카","콜리","클라인스피츠","키슈","키스 훈드","토이 맨체스터 테리어","토이 푸들","티베탄 마스티프","파라오 하운드","파슨 러셀 테리어","팔렌","퍼그","페키니즈","페터데일테리어","포메라니안","포인터","폭스테리어","푸들","풀리","풍산견","프레사까나리오","프렌치 불독","프렌치 브리타니","플랫 코티드 리트리버","플롯하운드","피레니안 마운틴 독","필라 브라질레오","핏불테리어","허배너스","화이트리트리버","화이트테리어","휘펫"]
	var arr417000value = ["000054","000056","000055","000118","000115","000037","000081","000204","000083","000082","000038","000039","000040","000043","000042","000153","000041","000120","000155","000069","000071","000142","000093","000167","000070","000166","000094","000121","000152","000073","000146","000072","000159","000076","000075","000079","000078","000077","000074","000080","000114","000133","000012","000017","000015","000164","000157","000148","000016","000020","000021","000022","000024","000208","000023","000026","000027","000169","000025","000019","000013","000018","000014","000162","000085","000096","000095","000001","000034","000104","000031","000099","000122","000123","000097","000132","000105","000154","000124","000100","000103","000151","000139","000101","000102","000098","000136","000202","000160","000203","000008","000131","000009","000119","000150","000210","000057","000058","000059","000006","000004","000007","000005","000143","000011","000010","000137","000084","000163","000112","000113","000149","211","000110","000205","000108","000109","000060","000046","000047","000044","000045","000053","000062","000061","000052","000165","000051","000156","000129","000067","000035","000033","000032","000158","000144","000030","000029","000064","000207","000028","000002","000068","000125","000141","000145","000036","000066","000065","000063","000140","000107","000106","000209","000086","000088","000090","000087","000138","000089","000126","000127","000128","000091","000003","000161","000050","000168","000049","000147","000092","000048","000135","000206","000130","000134","000111"];
	var arr422400 = ["고양이","기타","노르웨이 숲","데본 렉스","러시안 블루","레그돌","레그돌-라가머핀","맹크스","먼치킨","메인쿤","믹스묘","발리네즈","버만","벵갈","봄베이","브리티시 쇼트헤어","사바나캣","샤트룩스","샴","셀커크 렉스","소말리","스노우 슈","스코티시폴드","스핑크스","시베리안 포레스트","싱가퓨라","아메리칸 쇼트헤어","아비시니안","재패니즈밥테일","터키시 앙고라","통키니즈","페르시안","페르시안-페르시안 친칠라","하바나 브라운","하일랜드 폴드","한국 고양이"];
	var arr422400value = ["000116","000201","000170","000171","000172","00213","000173","000174","000175","000176","000212","000177","000178","000179","000180","000181","000182","000183","000184","000185","000186","000187","000188","000189","000190","000191","000192","000193","000194","000195","000196","00214","000197","000198","000199","000200"];
	var arr429900 = ["기타축종"];
	var arr429900value = ["000117"];
	
	var kind = document.getElementById("kind");
	var selectedValue = kind.options[kind.selectedIndex].value;
	
	
	if (selectedValue == "417000") {
		var d = arr417000;
		var v = arr417000value;
	} else if (selectedValue == "422400") {
		var d = arr422400;
		var v = arr422400value;
	} else if (selectedValue == "429900") {
		var d = arr429900;
		var v = arr429900value;
	}
	var target = document.getElementById("kind2");
	target.options.length = 0;

	for (x in d) {
		var opt = document.createElement("option");
		opt.value = v[x];
		opt.innerHTML = d[x];
		target.appendChild(opt);
	}
}




